{
  "_name_or_path": "abhinavkk/distilled_bert_classification_gpu",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "Bank account or service",
    "1": "Checking or savings account",
    "2": "Consumer Loan",
    "3": "Credit card or prepaid card",
    "4": "Credit reporting, credit repair services, or other personal consumer reports",
    "5": "Debt collection",
    "6": "Money transfer, virtual currency, or money service",
    "7": "Mortgage",
    "8": "Payday loan, title loan, personal loan, or advance loan",
    "9": "Student loan",
    "10": "Vehicle loan or lease"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Bank account or service": 0,
    "Checking or savings account": 1,
    "Consumer Loan": 2,
    "Credit card or prepaid card": 3,
    "Credit reporting, credit repair services, or other personal consumer reports": 4,
    "Debt collection": 5,
    "Money transfer, virtual currency, or money service": 6,
    "Mortgage": 7,
    "Payday loan, title loan, personal loan, or advance loan": 8,
    "Student loan": 9,
    "Vehicle loan or lease": 10
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.38.0",
  "vocab_size": 30522
}
